# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
list=[1,4,5,6,7,7]
i=0
summa=0
while i < len(list)/2:
    y=len(list)-i-1
    summa= list[i] + list[y]
    print(list[i] + list[y])
    i+=1
