# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
n=int(input("Введите число: "))
for i in n:
    # g= (1+\frac 1 n)^n
    # print(f"{(1+\frac 1 n)^n}")