# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

list=[1,4,5,6,7]
i=0
summa=0
while i < len(list):
    if list[i]%2==0:
        i+=1
    else:
        summa= summa+list[i]
        i+=1
print(summa)

