#Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
x = int(input("Введите номер четверти :"))
if x==1:
    print('диапазон для x>0 y>0')
elif x==2:
    print('диапазон для x>0 y<0')
elif x==3:
    print('диапазон для x<0 y<0')  
elif x==4:
    print('диапазон для x<0 y>0')   
elif x>4 or x<1:
    print('недопустимый номер четверти')